# Задание 1:
name = input ('Введите имя:')
surname = input ('Введите фамилию:')
year = int (input('Введите год рождения:'))

print (surname, name, ",", 2024 - year)