#Задание 2:
number = int (input ('Введите число:'))

print (
    f"Следующее за числом {number} число: {1 + number}",
    f"Для числа {number} предыдущее число: {number - 1}",
    sep='\n'       
)
