# Задание 3:
minute = int (input ('Введите минуты:'))

print (
    f"{minute} минут - это {int(minute/60)} ч {minute%60} мин"
)