# Задание 1:
name = input('Введите имя:')  #  СОВЕТ: после input пробелы не нужны, лучше сделать так: input('Введите имя:')
surname = input('Введите фамилию:')  # СОВЕТ: после input пробелы не нужны, лучше сделать так: input('Введите фамилию:')
year = int(input('Введите год рождения:'))  # СОВЕТ: после int пробелы не нужны, лучше сделать так: int(input('Введите год рождения:')) 

print(surname, name, ",", 2024 - year)  # СОВЕТ: после print пробелы не нужны, лучше сделать так: print(surname, name, ",", 2024 - year)

# Внимательно читайте задание целиком, нужно было так же скопировать пример ввода и пример вывода, тем не менее в первый раз засчитываю. =)

# Пример ввода:
#     Введите имя: Иван
#     Введите фамилию: Петров
#     Введите год рождения: 2009

# Пример вывода:
#     Петров Иван, 12
