#Задание 2:
number = int(input('Введите число:'))  # СОВЕТ: после int и input пробелы не нужны, лучше сделать так: int(input("Введите число:"))

print(
    f"Следующее за числом {number} число: {1 + number}",
    f"Для числа {number} предыдущее число: {number - 1}",
    sep='\n'       
)  # СОВЕТ: после print пробелы не нужны

# Внимательно читайте задание целиком, нужно было так же скопировать пример ввода и пример вывода, тем не менее в первый раз засчитываю. =)

# Пример ввода:
#     20

# Пример вывода:
#     Следующее за числом 20 число: 21
#     Для числа 20 предыдущее число: 19

