# Задание 3:
minute = int(input('Введите минуты:'))

print(
    f"{minute} минут - это {int(minute/60)} ч {minute%60} мин"
)  # СОВЕТ: после print пробелы не нужны


# Внимательно читайте задание целиком, нужно было так же скопировать пример ввода и пример вывода, тем не менее в первый раз засчитываю. =)

# Пример ввода:
#     150

# Пример вывода:
#     150 мин - это 2 час 30 мин

